tests/env01_backup/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16200
(
(0.98011073 0.026253219 9.0874682e-22)
(0.94776689 -0.048484385 8.0565106e-21)
(1.0866774 -0.047512258 0)
(1.2079885 -0.12184722 -5.58154e-21)
(1.0529507 0.0685883 -1.0155898e-20)
(1.2083542 -0.011731009 0)
(1.3982031 -0.058400546 -2.9698804e-20)
(1.453875 -0.13463175 0)
...
)
;

boundaryField
{
    INLET
    {
        type            inletParabolicVelocity;
        maxValue        1.5;
        n               (1 0 0);
        y               (0 1 0);
        value           nonuniform List<vector> 
21
(
(0.83333342 0 0)
(0.62925174 0 0)
(0.13945586 0 0)
(0.83333354 0 0)
(1.377551 0 0)
(1.4863945 0 0)
(0.39795926 0 0)
(0.13945611 0 0)
(0.3979597 0 0)
(0.62925205 0 0)
(1.0102041 0 0)
(1.1598639 0 0)
(1.0102042 0 0)
(1.2823129 0 0)
(1.159864 0 0)
(1.4455782 0 0)
(1.4863946 0 0)
(1.5 0 0)
(1.3775509 0 0)
(1.4455782 0 0)
(1.2823129 0 0)
)
;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    TOP
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    CYLINDER
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    JET1
    {
        type            incrementalJetParabolicVelocity;
        omega           0.17453293;
        r               0.05;
        theta0          1.5707963;
        q0              0;
        q1              0;
        alpha           0.1;
        deltaT          0.0005;
        t0              0;
        value           uniform (0 0 0);  
    }
    
    JET2
    {
        type            incrementalJetParabolicVelocity;
        omega           0.17453293;
        r               0.05;
        theta0          1.5707963;
        q0              0;
        q1              0;
        alpha           0.1;
        t0              0;
        deltaT          0.0005;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
